app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT ?  [["LIMIT", 1]]
---
	def create
		#complete this method
    user = User.find_by_email(params[:email])